In [1]:
import pandas as pd

## series  || values || index

In [2]:
ser=pd.Series([2,5,32,4,43,2,2])
ser

0     2
1     5
2    32
3     4
4    43
5     2
6     2
dtype: int64

In [3]:
ser.values

array([ 2,  5, 32,  4, 43,  2,  2], dtype=int64)

In [4]:
ser.index 
# ser.index.tolist()

RangeIndex(start=0, stop=7, step=1)

In [5]:
ser.index=['a','b','c','d','e','f','g']

In [6]:
ser

a     2
b     5
c    32
d     4
e    43
f     2
g     2
dtype: int64

In [7]:
ser['e']=77777

In [9]:
ser['aaa']=3333   #thats how u add new key:value  
#                                   index:value

In [10]:
ser

a          2
b          5
c         32
d          4
e      77777
f          2
g          2
aaa     3333
dtype: int64

In [9]:
ser[ser>4]

b        5
c       32
e    77777
dtype: int64

In [10]:
ser*-1

a       -2
b       -5
c      -32
d       -4
e   -77777
f       -2
g       -2
dtype: int64

In [11]:
ser

a        2
b        5
c       32
d        4
e    77777
f        2
g        2
dtype: int64

In [11]:
ser.f   #this is also possible

2

In [15]:
ser.Taimoor =124   #u cannot add new index 
ser

a          2
b          5
c         32
d          4
e      77777
f      12345
g          2
aaa     3333
dtype: int64

In [16]:
ser.f=12345 #but already existing index can be call or get reassign value like that
ser

a          2
b          5
c         32
d          4
e      77777
f      12345
g          2
aaa     3333
dtype: int64

### think of series like dictionary
because they behave like dictionary
so index are keys

In [12]:
'a' in ser   #in dictionary when we use in on dict it compare keys 
             #here we have 'a' as key and we know in dictionary it will compare key
            #that is why it is True

True

In [13]:
'f' in ser    #again compare with key

True

In [14]:
2 in ser.values

True

In [15]:
ser.items()

In [16]:
list(ser.items())

[('a', 2), ('b', 5), ('c', 32), ('d', 4), ('e', 77777), ('f', 2), ('g', 2)]

In [17]:
d={'car':1200,'bike':300,'cycle':100}

In [18]:
pd.Series(d)

car      1200
bike      300
cycle     100
dtype: int64

# important ||  index list authority
cycle from &nbsp;&nbsp;&nbsp;&nbsp;index/key/list &nbsp;&nbsp; match with cycle of dict &nbsp;&nbsp;<b> d </b>so saved<br> 
bike from &nbsp;&nbsp;&nbsp;&nbsp;index/key/list&nbsp;&nbsp; match with bike of dict &nbsp;&nbsp;<b> d </b>so saved<br>
but v1 v2 v3 were not present in d so they got NaN value but got saved because they are index and index is key <br>
and car was in dict <b>d</b> but not in list so got removed<br>

### those who are in index=list 
will remain ,<br>
and there values will be taken from 'd' if key matches


### when u create panda series you give two things
1. data
2. index
## panda only take index and then from index search for index values in data
here data is d
intex is ty

so panda only talk adopt "ty"<br>
and then ty gets its things from data<br>
if index does not find its value it give itself NaN<br>
if index finds  value it store it face to face with that index that matched<br>
it does not allow new index to join in from d<br>
it only takes values from those keys that are same to index

In [19]:
ty=['v1','v2','v3','cycle','bike'] 
new_ser=pd.Series(d,index=ty) #take the values from 'd' for index as key if match other wise value=NaN
new_ser

v1         NaN
v2         NaN
v3         NaN
cycle    100.0
bike     300.0
dtype: float64

In [20]:
new_ser.isnull() #make true if null
# new_ser.isna() #same
# pd.isnull(new_ser)
#pd.isna(new_ser)

v1        True
v2        True
v3        True
cycle    False
bike     False
dtype: bool

In [21]:
new_ser.notnull()
# new_ser.notna()  #same
# pd.notnull(new_ser) #same
# pd.notna(new_ser) #same

v1       False
v2       False
v3       False
cycle     True
bike      True
dtype: bool

#  series name || series index name

In [22]:
new_ser.name='vehical_chalan_fee'

In [23]:
new_ser.index.name="vehical_type"

In [24]:
new_ser

vehical_type
v1         NaN
v2         NaN
v3         NaN
cycle    100.0
bike     300.0
Name: vehical_chalan_fee, dtype: float64

# DataFrame

In [25]:
dict={
    'physic':[90,80,70,40,30],
    'chemistry':[40,60,70,90,80],
    'math':[40,50,60,70,80]
}

In [26]:
pd.DataFrame(dict)

   physic  chemistry  math
0      90         40    40
1      80         60    50
2      70         70    60
3      40         90    70
4      30         80    80

In [27]:
pd.DataFrame(dict,columns=['urdu','physic','math','english']) #just like series index
                                                    #columns=list also act as keys
                                                    #we will going to have 4columns
                                                    #if column name matches with data column then thats good
                                                    #if column name not in data still we will create that column with NaN
                                                    #rest of data is ignored
                                                
# columns list mean just pick these column with these names if not create it and give NaN
#ignore columns that are not mention in column=[] list

  urdu  physic  math english
0  NaN      90    40     NaN
1  NaN      80    50     NaN
2  NaN      70    60     NaN
3  NaN      40    70     NaN
4  NaN      30    80     NaN

In [28]:
pd.DataFrame(dict,columns=['urdu','physic','math','english']
                ,index=[chr(x) for x in range(65,70)] ) #if range is shorter or longer it give value error

  urdu  physic  math english
A  NaN      90    40     NaN
B  NaN      80    50     NaN
C  NaN      70    60     NaN
D  NaN      40    70     NaN
E  NaN      30    80     NaN

In [29]:
data=pd.DataFrame(dict,columns=['urdu','physic','math','english']
                ,index=[chr(x) for x in range(65,70)] )

In [30]:
data

  urdu  physic  math english
A  NaN      90    40     NaN
B  NaN      80    50     NaN
C  NaN      70    60     NaN
D  NaN      40    70     NaN
E  NaN      30    80     NaN

In [31]:
data.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [32]:
data.columns

Index(['urdu', 'physic', 'math', 'english'], dtype='object')

In [33]:
data.urdu

A    NaN
B    NaN
C    NaN
D    NaN
E    NaN
Name: urdu, dtype: object

In [34]:
data['physic']

A    90
B    80
C    70
D    40
E    30
Name: physic, dtype: int64

In [35]:
data.loc["C":,'physic']

C    70
D    40
E    30
Name: physic, dtype: int64

In [36]:
data.iloc[2:,1]

C    70
D    40
E    30
Name: physic, dtype: int64

In [37]:
data.loc['C',:] #getting row complete

urdu       NaN
physic      70
math        60
english    NaN
Name: C, dtype: object

In [38]:
#addig english result
import numpy as np
data.english=np.random.randint(50,97,size=(5)) #give value error if u increase or decrease size

In [39]:
data

  urdu  physic  math  english
A  NaN      90    40       88
B  NaN      80    50       76
C  NaN      70    60       64
D  NaN      40    70       86
E  NaN      30    80       84

In [40]:
#now urdu marks
data.urdu=np.random.randint(40,80,size=(data.shape[0])) #instead of using direct 5 i use total rows of data

In [41]:
data

   urdu  physic  math  english
A    79      90    40       88
B    61      80    50       76
C    65      70    60       64
D    42      40    70       86
E    63      30    80       84

In [42]:
data.loc['C',:]=np.random.randint(60,99,size=(data.shape[1]))  #givin values to single row thus corrosponding columns

In [43]:
data

   urdu  physic  math  english
A    79      90    40       88
B    61      80    50       76
C    69      83    97       60
D    42      40    70       86
E    63      30    80       84

In [44]:
data.T  #rows to column values and labels trannsform

          A   B   C   D   E
urdu     79  61  69  42  63
physic   90  80  83  40  30
math     40  50  97  70  80
english  88  76  60  86  84

In [45]:
data.values

array([[79, 90, 40, 88],
       [61, 80, 50, 76],
       [69, 83, 97, 60],
       [42, 40, 70, 86],
       [63, 30, 80, 84]], dtype=int64)

## give series to column || index must match

In [47]:
data['male']=np.nan

In [53]:
gender=pd.Series(['male','male','male'],index=['A','D','E'])
data['male']=gender

In [55]:
data  #rest of male got nan
        #it give value error if index element is not in data
        #so for X , Y ,Z give value error
        #but work when index have same row name as of index contain

   urdu  physic  math  english  male
A    79      90    40       88  male
B    61      80    50       76   NaN
C    69      83    97       60   NaN
D    42      40    70       86  male
E    63      30    80       84  male

In [63]:
data=pd.DataFrame(data.values.tolist(),index=['a','a','a','a','a'],columns=['physic','chemistry','math','urdu','english'])

In [64]:
data

   physic  chemistry  math  urdu english
a      79         90    40    88    male
a      61         80    50    76     NaN
a      69         83    97    60     NaN
a      42         40    70    86    male
a      63         30    80    84    male

##  all index Series can have a name || all column header also have  a name

In [73]:
data.columns.name='subject'
data

subject    physic  chemistry  math  urdu english
stud_Name
a              79         90    40    88    male
a              61         80    50    76     NaN
a              69         83    97    60     NaN
a              42         40    70    86    male
a              63         30    80    84    male

In [74]:
data.index.name='stud_Name'

In [75]:
data

subject    physic  chemistry  math  urdu english
stud_Name
a              79         90    40    88    male
a              61         80    50    76     NaN
a              69         83    97    60     NaN
a              42         40    70    86    male
a              63         30    80    84    male